/*Series23. Дано целое число N (> 2) и набор из N вещественных чисел. Набор
называется пилообразным, если каждый его внутренний элемент либо
больше, либо меньше обоих своих соседей (то есть является «зубцом»).
Если данный набор является пилообразным, то вывести 0; в противном
случае вывести номер первого элемента, не являющегося зубцом.*/
#include <stdio.h>
int main() {
	int n;
	scanf("%d", &n);
	double a, b, num;
	scanf("%lf", &a);
	scanf("%lf", &b);
	int idx = 0;
	int i;
	for (i = 3; i <= n; i++) {
		scanf("%lf", &num);
		if (idx == 0 && !((b > a && b > num) || (b < a && b < num))) {
			idx = i - 1;
		}
		a = b;
		b = num;
	}	
	printf("%d", idx);
	return 0;
}
